app/controllers/pointclouds_controller.rb

  def index
  	@pointcloud = Pointcloud.all
---
SELECT "pointclouds".* FROM "pointclouds"

  def create
  	@pointcloud = Pointcloud.new(pointcloud_params)

  	if @pointcloud.save
---
INSERT INTO "pointclouds" ("name", "attachment", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Hey"], ["attachment", "test.3d"], ["created_at", 2016-12-01 00:58:59 UTC], ["updated_at", 2016-12-01 00:58:59 UTC]]

  def destroy
  	@pointcloud = Pointcloud.find(params[:id])
  	@pointcloud.destroy
---
SELECT  "pointclouds".* FROM "pointclouds" WHERE "pointclouds"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "pointclouds" WHERE "pointclouds"."id" = $1  [["id", 980190962]]

  def show
    @pointcloud = Pointcloud.find(params[:id])
---
SELECT  "pointclouds".* FROM "pointclouds" WHERE "pointclouds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]