app/controllers/users_controller.rb

  def create
  	@user = User.new(user_params)

  	if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "kohdy"], ["email", "kohdy.nicholson@gmail.com"], ["created_at", 2016-12-01 01:37:24 UTC], ["updated_at", 2016-12-01 01:37:24 UTC]]